turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8C.atdf
        <register caption="LIN Mode Register" name="US_LINMR" offset="0x0054" rw="RW" size="4">
          <bitfield caption="LIN Node Action" mask="0x00000003" name="NACT" values="US_LINMR__NACT"/>
          <bitfield caption="Parity Disable" mask="0x00000004" name="PARDIS"/>
          <bitfield caption="Checksum Disable" mask="0x00000008" name="CHKDIS"/>
          <bitfield caption="Checksum Type" mask="0x00000010" name="CHKTYP"/>
          <bitfield caption="Data Length Mode" mask="0x00000020" name="DLM"/>
          <bitfield caption="Frame Slot Mode Disable" mask="0x00000040" name="FSDIS"/>
          <bitfield caption="Wakeup Signal Type" mask="0x00000080" name="WKUPTYP"/>
          <bitfield caption="Data Length Control" mask="0x0000FF00" name="DLC"/>
          <bitfield caption="PDC Mode" mask="0x00010000" name="PDCM"/>
        </register>
        <register caption="LIN Identifier Register" name="US_LINIR" offset="0x0058" rw="RW" size="4">
          <bitfield caption="Identifier Character" mask="0x000000FF" name="IDCHR"/>
        </register>
        <register caption="LIN Baud Rate Register" name="US_LINBRR" offset="0x005C" rw="R" size="4">
          <bitfield caption="Clock Divider after Synchronization" mask="0x0000FFFF" name="LINCD"/>
          <bitfield caption="Fractional Part after Synchronization" mask="0x00070000" name="LINFP"/>
        </register>
        <register caption="Write Protection Mode Register" name="US_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="US_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="US_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="US_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="US_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="US_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="US_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="US_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="US_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="US_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="US_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="US_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="US_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="US_MR__USART_MODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="RS485" name="RS485" value="0x1"/>
        <value caption="Hardware Handshaking" name="HW_HANDSHAKING" value="0x2"/>
        <value caption="IS07816 Protocol: T = 0" name="IS07816_T_0" value="0x4"/>
        <value caption="IS07816 Protocol: T = 1" name="IS07816_T_1" value="0x6"/>
        <value caption="IrDA" name="IRDA" value="0x8"/>
        <value caption="LIN master" name="LIN_MASTER" value="0xA"/>
        <value caption="LIN Slave" name="LIN_SLAVE" value="0xB"/>
        <value caption="SPI master" name="SPI_MASTER" value="0xE"/>
        <value caption="SPI Slave" name="SPI_SLAVE" value="0xF"/>
      </value-group>
      <value-group caption="" name="US_MR__USCLKS">
        <value caption="master Clock MCK is selected" name="MCK" value="0x0"/>
        <value caption="Internal Clock Divided MCK/DIV (DIV=8) is selected" name="DIV" value="0x1"/>
        <value caption="Serial Clock SLK is selected" name="SCK" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_MR__CHRL">
        <value caption="Character length is 5 bits" name="_5_BIT" value="0x0"/>
        <value caption="Character length is 6 bits" name="_6_BIT" value="0x1"/>
        <value caption="Character length is 7 bits" name="_7_BIT" value="0x2"/>
        <value caption="Character length is 8 bits" name="_8_BIT" value="0x3"/>
      </value-group>
